In [124]:
import pandas as pd

In [125]:
df = pd.read_csv("titanic.csv")

In [126]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [127]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis = 'columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [128]:
y = df.Survived
x = df.drop('Survived',axis='columns')

In [129]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [130]:
x.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [131]:
dummies = pd.get_dummies(x.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [132]:
x = pd.concat([x,dummies],axis='columns')
x.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [133]:
x.drop('Sex',axis='columns',inplace=True)
x.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [134]:
x.columns[x.isna().any()]

Index(['Age'], dtype='object')

In [135]:
x.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [136]:
x.Age = x.Age.fillna(x.Age.mean())
x.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [137]:
x.columns[x.isna().any()]

Index([], dtype='object')

In [138]:
from sklearn.model_selection import train_test_split

In [139]:
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size=0.2)

In [140]:
len(x_train)

712

In [141]:
len(x_test)

179

In [142]:
len(x)

891

In [143]:
x_train

     Pclass        Age      Fare  female  male
100       3  28.000000    7.8958       1     0
304       3  29.699118    8.0500       0     1
377       1  27.000000  211.5000       0     1
775       3  18.000000    7.7500       0     1
637       2  31.000000   26.2500       0     1
..      ...        ...       ...     ...   ...
467       1  56.000000   26.5500       0     1
391       3  21.000000    7.7958       0     1
547       2  29.699118   13.8625       0     1
784       3  25.000000    7.0500       0     1
392       3  28.000000    7.9250       0     1

[712 rows x 5 columns]

In [144]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [145]:
model.fit(x_train,y_train)

GaussianNB()

In [146]:
model.score(x_test,y_test)

0.7653631284916201

In [147]:
x_test[:10]

     Pclass        Age     Fare  female  male
154       3  29.699118   7.3125       0     1
666       2  25.000000  13.0000       0     1
167       3  45.000000  27.9000       1     0
888       3  29.699118  23.4500       1     0
625       1  61.000000  32.3208       0     1
237       2   8.000000  26.2500       1     0
820       1  52.000000  93.5000       1     0
99        2  34.000000  26.0000       0     1
303       2  29.699118  12.3500       1     0
651       2  18.000000  23.0000       1     0

In [148]:
y_test[:10]

154    0
666    0
167    0
888    0
625    0
237    1
820    1
99     0
303    1
651    1
Name: Survived, dtype: int64

In [149]:
model.predict(x_test[:10])

array([0, 0, 1, 1, 0, 1, 1, 0, 1, 1], dtype=int64)

In [151]:
model.predict_proba(x_test[:10])

array([[0.99199019, 0.00800981],
       [0.98162435, 0.01837565],
       [0.09637498, 0.90362502],
       [0.10157999, 0.89842001],
       [0.90298855, 0.09701145],
       [0.02951308, 0.97048692],
       [0.00108799, 0.99891201],
       [0.98216356, 0.01783644],
       [0.04924256, 0.95075744],
       [0.04029168, 0.95970832]])